<template>
  <div class="wrapper">
    <div class="minibar">
      <wxc-minibar
              background-color="#53beb7"
              text-color="#fff"
              @wxcMinibarLeftButtonClicked="minibarLeftButtonClick"
              v-once
      >
        <image :style="GLOBAL.headerImg"  slot="left"
               src="https://image.aftdc.com/appBimg/icon_back_normal.png"></image>
        <text :style="GLOBAL.headerCenter"  slot="middle">服务协议</text>
        <!--<text :style="GLOBAL.headerRight"  slot="right">帮助</text>-->
      </wxc-minibar>
    </div>
    <scroller class="scroller" show-scrollbar="false">
    <text class='head'>阿凡提点餐商户服务协议</text>
    <text class='time'>日期：2018年1月15日</text>
    <text class='one'>        在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以粗体标注的内容）。理解和同意本协议的全部内容是您使用阿凡提点餐任一服务的前提，您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得本商城对您问询的解答等理由，主张本协议无效、或要求撤销本协议。</text>
    <text class='one'>        您同意本服务条款及使用条件的方式包括但不限于：1)通过点击“我同意”或者其他方式接受；2)通过电子邮件、电话、传真、即时通信等方式所作的口头或书面表示；3)本协议中有“默认同意”条款，您对此无异议的；4)其他您与本商城均认可的方式。。</text>
    <text class='one'>        如果您对本协议的条款有任何疑问，请通过本商城商家客服渠道进行询问，本商城将向您解释条款内容。如果您不同意本协议的任何内容，或者无法准确理解条款的含义或本商城对条款的解释，请不要使用本服务。</text>
    <text class='one'>        本协议由同意并遵守本协议规定使用本服务的法律实体（以下简称“商户”）和阿凡提点餐（以下简称“本商城”）共同签署。</text>
    <text class='two'>        一、协议内容及效力</text>
    <text class='one'>        1.1 本协议列明的条款不能完整罗列并覆盖本商城与商户之间的所有权利与义务，因此本协议包含正文以及所有本商城已经发布的或将来发布并依法通知商户的各类规则。所有本商城公布的规则、使用帮助和流程及商户于本商城订购服务所签署的各项协议均为本协议的补充协议，均是本协议不可分割的组成部分，与协议正文具有同等法律效力。商户在使用本商城提供的各项服务时，承诺接受并遵守各项相关规则的规定。本商城可根据需要不时地修改本协议或制定、修改各类规则，但是对于影响商户权利义务的变更本商城将提前在本商城网站进行公示。</text>
    <text class='one'>        1.2 任何对本协议的修订和对规则的制定或修改一经生效即构成本协议各方权利义务的补充，并成为本协议的一部分。如商户不同意相关变更，需立即以正式书面盖章的形式告知本商城，本商城有权选择立即与商户解约。如相关变更生效后，商户登录或继续使用本商城服务将表示商户接受修订后的协议。除另行书面声明或另行签署协议外，任何扩大的服务范围或软件功能增加均受本协议约束。</text>
    <text class='one'>        1.3 本协议一经商户或商户授权的任何人点击确认即与商户和本商城之间发生法律约束力。</text>
    <text class='two'>        二、合作模式</text>
    <text class='one'>        2.1 微选商城根据其技术能力和资源向商户提供基础服务（包括商户信息发布、编辑、维护等），现有以及后续可能提供增值服务、推广技术服务等。本商城提供的服务的服务内容、要求、条件等，以服务说明或平台规则为准。商户接受上述服务，需同意相关规则。</text>
    <text class='one'>        2.2 商户通过微信或引导用户到其他渠道向买家销售商品或服务，商户应当依法经营，遵守国家相关法律法规的规定，履行消费者保障义务（包括但不限于“网购商品七天无理由退货”义务、产品质量保障等），独立承担作为销售方应承担的责任和风险。</text>
    <text class='two'>        三、商户的承诺与保证</text>
    <text class='one'>        在服务使用过程中，商户承诺并保证：</text>
    <text class='one'>        3.1 其符合当前本商城入驻标准规定的申请条件，且向本商城提供真实、合法、准确、有效的信息和资料，并保证其提供的电子邮件地址、联系电话等内容的有效性及安全性，保证本商城及其他用户可以通过上述联系方式与自己进行联系。同时，商户也有义务在相关资料实际变更时及时更新有关信息和资料。</text>
    <text class='one'>        3.2 其承诺遵守本协议及所有公示于本商城的规则和流程。</text>
    <text class='one'>        3.3 其拥有合法的权利能力和行为能力缔结本协议并使用本商城相关服务。</text>
    <text class='one'>        3.4 其提供、发布、编辑、更新的所有信息（包括但不限于文字、图片等）真实、准确，符合有关法律法规规定，并不侵犯任何人的合法权益。</text>
    <text class='one'>        3.5 商户承诺授予本商城免费的、非独占的、不可撤销的权利和许可（并有权对该权利进行再授权），以推广相关商品和/或相关品牌为目的，本商城有权使用、复制、演示、展示、分发、改编、修改、翻译、重新排版商户公示于其本商城提供、发布的各类信息（包括但不限于商品商标、LOGO、作品等）或以现在已有或日后开发的任何形式、媒体或技术，将上述信息纳入其他作品内。本商城不会更改商户所提供的商标的形式（除非为了推广介绍的目的而改变商标的大小，前提是相关比例保持不变）。</text>
    <text class='two'>        四、免责声明与一般豁免</text>
    <text class='one'>        4.1 本商城及其服务，包括所有内容、软件、功能以及与服务有关的信息，均按其“现状”和“可得到”状态提供。作为这些服务的使用者，商户使用本商城这些服务应自行承担风险。在法律允许的最大范围内，商户放弃要求，同时本商城免于承担：</text>
    <text class='one'>        （1）对本协议、本协议项下的服务以及预期交易的任何陈述与保证，包括对适销性、适用于特定目的或不侵权的任何默示担保；</text>
    <text class='one'>        （2）基于交易过程、合同履行或交易惯例产生的默示担保；</text>
    <text class='one'>        （3）任何义务、责任、权利、主张或侵权救济或非因本商城故意所导致的排字错误、遗漏等，不论其是否由于本商城的疏忽产生。本商城不保证所包含的功能和服务将满足商户的要求，或是随时可用、及时、安全、不间断或无错误的，本商城也不对任何服务中断承担责任，包括但不限于系统崩溃或其他可能影响任何交易的接收、处理、完成或结算的中断。</text>
    <text class='one'>        4.2 本商城对由于政府行为譬如政策或法规的变更、自然灾害或战争、通讯线路中断、黑客攻击、计算机病毒侵入或发作、电信部门技术调整、因政府管制而造成网站的暂时性关闭等任何影响网络正常运营的不可抗力事件，以及他人蓄意破坏、正常的系统维护、系统升级，或者因网络拥塞而导致本服务不能访问而造成的本服务所提供的信息及数据的延误、停滞或错误，以及商户由此受到的一切损失不承担任何责任。</text>
    <text class='one'>        4.3 本商城不对商户所发布或提供的数据信息的保存、修改、删除或储存失败负责。本商城可以根据实际情况自行决定商户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。商户可根据自己的需要自行备份本服务中的相关数据。商户在此明确同意并接受，如商户停止使用本服务或本服务终止或商户的商户账号被收回的，本商城可以从服务器上永久地删除商户的全部数据。本服务终止后，本商城没有义务向商户返还任何数据。</text>
    <text class='one'>        4.4 如果商户与第三方就商户的产品产生争议，则商户和第三方都不应向本商城提出与此争议相关的任何形式和性质的主张、要求和损害赔偿（包括实际损害和间接损害），不论这些主张、要求和损害赔偿是否已知、确定或已被披露。</text>
    <text class='one'>        4.5 因商户商品、发布的信息或提供的售后服务引发消费者与本商城及/或本商城关联方的争议、纠纷或诉讼，本商城有权披露商户的相关信息，商户应承担因客户争议、纠纷或诉讼而产生的全部法律责任，如因此造成本商城承担连带责任或遭受损失的，本商城有权要求商户赔偿本商城的全部损失。</text>
    <text class='two'>        五、禁止商业贿赂</text>
    <text class='one'>        5.1 双方均应严格遵守《中华人民共和国反不正当竞争法》、《关于禁止商业贿赂行为的暂行规定》、《中华人民共和国刑法》、《关于办理商业贿赂刑事案件适用法律若干问题的意见》等关于禁止商业贿赂行为的规定，坚决拒绝商业贿赂、行贿及其他不正当之商业行为。</text>
    <text class='one'>        5.2 双方确认商业贿赂是指商户或商户的工作人员为促成交易或从本商城取得比他人更多的商业利益或更特殊的商业待遇而给予本商城工作人员不正当利益的行为，包括但不限于提供：</text>
    <text class='one'>        （1）促销费、宣传费、赞助费、科研费、劳务费、咨询费、佣金或报销各种费用、含有金额的会员卡、代币卡（券）、旅游、考察、房屋装修等。</text>
    <text class='one'>        （2）借款、融资担保、商品赊销、回扣、购物折扣、置业、礼品（如纪念品、节日礼品等）、馈赠、娱乐、招待等。</text>
    <text class='one'>        5.3 本商城及本商城工作人员接受商户提供的上述不正当利益行为不承担还款或担保等任何法律责任，商户也不得以此为由主张减免或抵扣任何应付费用或拒绝履行其他合同义务。</text>
    <text class='one'>        5.4 若本商城工作人员要求商户或商户的工作人员给予其上述任何形式的不正当利益，商户应向本商城举报并提供相关证据，本商城查实后将及时公正处理，并为商户严格保密。</text>
    <text class='one'>        5.5 若发现商户或其工作人员违反本条规定，本商城有权解除协议，商户除需按本商城查明的行贿金额的两倍向本商城支付违约金外，还需按本协议其他约定承担导致协议终止的违约责任。同时本商城可依法对商户采取必要措施（包括暂停支付所有应付账款，或通过司法途径向商户追偿由此造成本商城的一切经济及商誉损失），并将商户列入本商城及本商城所属集团的黑名单，永不合作。</text>
    <text class='two'>        六、有效通知</text>
    <text class='one'>        6.1 商户在入驻本商城时必须提供真实有效联系方式，对于联系方式发生变更的，商户有义务及时更新有关信息，并保持可被联系的状态。</text>
    <text class='one'>        6.2 商户在注册本商城时生成的用于登陆本商城平台接收、发送站内信、系统消息和多多即时信息的会员账号（包括子账号），也作为商户的有效联系方式。</text>
    <text class='one'>        6.4 本商城通过商户向本商城提供的有效联系方式发出通知，其中以纸质载体发出的书面通知，按照商户提供联系地址交邮后的第五个自然日即视为送达。以电子的方式向商户发出的书面通知，包括但不限于在本商城平台公告、向商户提供的联系电话发送手机短信、向商户提供的电子邮件地址发送电子邮件、向商户的账号发送多多信息、系统消息以及站内信信息，在发送成功后即视为送达。</text>
    <text class='one'>        6.5 商户同意在使用本商城商户服务的同时接受本商城向其登记的电子邮件、手机、通信地址发送商业信息。</text>
    <text class='two'>        七、 各方关系</text>
    <text class='one'>        商户和本商城是独立的合同方，本协议并不在合同双方之间产生任何合伙、合资、代理、特许权使用、销售代表或雇佣关系。商户无权代表本商城发出或接受任何要约或承诺。商户不能在本商城网站或任何其他场所做出任何与本条规定相冲突的声明。本协议在商户与本商城之间不产生排他性合作关系。本协议及其项下所有陈述、保证、约定、条件和条款仅为本商城、商户以及相关用户或商户的利益而制定。在商户和本商城之间，商户将对与所有与使用第三方服务或商户允许本商城代表商户使用的内容负责，包括符合适用的使用条款。</text>
    <text class='two'>        八、期限与终止</text>
    <text class='one'>        本协议的有效期限自商户完成入驻注册开始，持续至本商城或商户提前三十（30）天书面通知或本协议约定的其他方式终止本协议，本协议于双方完成所有交易往来之日终止。本协议终止后，各方仍应继续履行在本协议终止前各自与用户之间的尚未履行完毕之相关交易或其他约定，直至各方之间不存在任何纠纷及异议为止。</text>
    <text class='two'>        九、 适用法律、管辖及其他</text>
    <text class='one'>        9.1 本协议适用中国法律 。本协议的签订地及履行地均为广州市白云区。</text>
    <text class='one'>        9.2 任何一方均在此不可撤销地同意，对与本商城因本协议或商户使用服务而发生的任何争议，均应由广州市白云区法院或根据法律规定要求由其上级法院专属管辖。</text>
    <text class='one'>        9.3 没有本商城的事先书面同意，商户不能基于法律实施或以其他方式转让本协议。在此限制的前提下，本协议对协议各方及其各自的继承人和受让人具有约束力，并可对其强制执行。本商城可以通过一个或多个关联机构履行本协议项下的任何义务或行使任何权利。本商城未要求商户严格履行本协议任何条款，不构成本商城对要求履行该条款或本协议任何其他条款的权利的放弃</text>
    </scroller>
  </div>

</template>

<script>
    import {WxcMinibar} from 'weex-ui';
export default {
    components: {WxcMinibar},
  data () {
    return {

    }
  },
    methods: {

        minibarLeftButtonClick() {

        },
    }
}
</script>

<style scoped>
  .wrapper {
    flex-direction: column;

  }
  .scroller{
    padding-left: 20px;
    padding-right: 20px;

  }
  .minibar {
    border-bottom-width: 2px;
    border-bottom-style: solid;
    border-bottom-color: #a1a1a1;
  }
  .backImg{
    width: 40px;
    height: 40px;
  }
.head{
  font-size: 45px;
  color: #333;
  text-align: center;
  margin-top: 20px;
  margin-bottom: 20px;
}
  .time{
    font-size: 35px;
    color: #333;
    text-align: right;
    margin-top: 20px;
    margin-bottom: 20px;
  }
 .one{
   font-size: 30px;
   color: #333;
  margin-top: 20px;
   margin-bottom: 20px;
   padding-left: 20px;
   padding-right: 20px;
 }
  .two{
    font-size: 30px;
    color: #333;
    margin-top: 20px;
    margin-bottom: 20px;
    padding-left: 20px;
    padding-right: 20px;
  }

</style>
