<template>
    <div class="wrapper" >
        <div class="minibar">
            <wxc-minibar
                    background-color="#53beb7"
                    text-color="#fff"
                    @wxcMinibarLeftButtonClicked="backClick"
                    @wxcMinibarRightButtonClicked="minibarRightButtonClick"
                    v-once>
                <image :style="GLOBAL.headerImg" slot="left"
                       src="https://image.aftdc.com/appBimg/icon_back_normal.png"></image>
                <text :style="GLOBAL.headerCenter" slot="middle">餐饮安全管理办法</text>
                <text :style="GLOBAL.headerRight" slot="right"></text>
            </wxc-minibar>
        </div>
        <scroller show-scrollbar="true">
        <div class="content">
            <text class="headerText dcolor bold" :style="{fontSize:GLOBAL.bigFS}">总则</text>
            <text class="lineHeight dcolor" :style="{fontSize:GLOBAL.smallFS}" v-for="(item,index) in preface">{{item}}</text>
            <div v-for="item in wifiServiceStatementText">
                <text class="mt24 mb18 dcolor bold" :style="{fontSize:GLOBAL.bigFS}">{{item.title}}</text>
                <div class="" v-for="(list,i) in item.text">
                    <text class="dcolor lineHeight" :style="{fontSize:GLOBAL.bigFS}">{{list.subtitle}}</text>
                    <text class="dcolor lineHeight" :style="{fontSize:GLOBAL.smallFS}" v-for="value in list.contentItem">{{value}}</text>
                </div>
            </div>
            <text class="dcolor lineHeight" :style="{fontSize:GLOBAL.smallFS,marginTop:'6px'}" >二〇一七年七月</text>
        </div>
        </scroller>
    </div>
</template>
<script>
    import {WxcMinibar} from 'weex-ui'
    export default {
        data() {
            return {
                preface: [
                    '1. 为保障餐饮安全，构建起阿凡提点评餐饮业务的食品安全保护网，阿凡提点评秉承“消费者第一 ”的理念，依据《食品安全法》、《网络食品安全违法行为查处办法》、 《北京市网络食品经营监督管理办法》、《上海市网络餐饮服务监督管理办法》、《消费者权益保护法》等法律法规规定，制定《阿凡提点评餐饮安全管理办法》。',
                    '2. 阿凡提点评餐饮安全管理的原则和目标是，确保餐饮安全风险商户零漏报、餐饮安全高危商户零容忍、餐饮安全零事故；同时与社会各界广泛合作、共同治理，成为食品安全产业发展的有益推动者。',
                    '3. 此管理办法的适用范围是，以阿凡提点评平台为载体开展的网络餐饮服务，具体指阿凡提点评餐饮商户通过阿凡提点评平台接受消费者订餐需求后制作并配送餐品的餐饮经营活动。'
                ],
                wifiServiceStatementText: [
                    {
                        title: '第一章 入网餐饮商户资质核查',
                        text: [
                            {
                                subtitle: '（一）入网前资质核查',
                                contentItem: [
                                    '4. 责任 BD 请商户提供符合当地法律法规要求的有效证照资质原件，并结合商户实际情况核对许可证日期、地址、经营范围等内容；自入驻商户上传符合上述要求的有效证照。',
                                    '5. 品控部门依据当地法律法规规定，对上传的商户证照资质信息进行验证，确保真实、有效。经品控严格审核通过的商户，才能够上线。'
                                ]
                            },
                            {
                                subtitle: '（二）入网后定期核验',
                                contentItem: [
                                    '6. 通过阿凡提点评研发的“商户证照云审核系统”对一证多用、证照过期、证照造假和仿冒、超出经营范围等情况进行定期重点核查，发现问题第一时间通知 BD 整改，情况严重时对商户做下线处理。',
                                    '7. 实行第三方专业机构“神秘客抽检“制度，定期对商户环境及证照进行抽检，出现不达标情况将督促整改，情况严重时对商户做下线处理。'
                                ]
                            },
                            {
                                subtitle: '（三）定期上报与沟通机制',
                                contentItem: [
                                    '8. 定期将阿凡提点评平台证照不合规的餐饮商户向政府监管部门上报，将信息向行业共享，实现信息互联互通。',
                                    '9. 如有在积极办理证照方面遇到问题的优质潜在商户，BD 可反馈到总部。总部将汇总共性问题，与政府部门合作共同推动解决。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第二章 商户信息建档与展示',
                        text: [
                            {
                                subtitle: '（一）商户信息建档',
                                contentItem: [
                                    '10. 商户入网前，阿凡提点评与商户签订入网协议，并与商户明确商户食品安全管理人员，与双方食品安全管理责任。',
                                    '11. 商户入网后，责任 BD 记录商户负责人的姓名、身份证信息、联系电话、商户地址等信息，并录入系统； 自入驻商户在后台自行提交上述信息。',
                                    '12. 商户入网后，形成独立的商户档案信息系统，涵盖入网时录入的基础信息，及商户入网、置休、下线等行为变化，餐饮安全量化分级的评级情况，消费者餐饮安全投诉及评价信息等，供公司内部管理与外部监管部门调阅。',
                                    '13. 鼓励商户使用阿凡提点评或其他供应商提供的餐饮 ERP 系统，对“从农田到餐桌”全过程进行信息化管理，推动建立“餐饮安全追溯机制”。（《食安法》第42条）',

                                ]
                            },
                            {
                                subtitle: '（二）商户信息变更',
                                contentItem: [
                                    '14. 如有证照更换、经营人变更、地址变更等情况，商户尽快在后台更新以上信息。',
                                    '15. BD 定期巡店，发现证照过期、经营人更换、地址变更等情况，立刻在后台更新商户信息，提交总部审核，情况严重时可对商户做下线处理。'
                                ]
                            },
                            {
                                subtitle: '（三）商户信息展示',
                                contentItem: [
                                    '16. 阿凡提点评商户经营页面亮出餐饮商户营业执照，按照法律规定应该取得食品经营许可证的商户，还应该亮出食品经营许可证。（《查处办法》第18条）',
                                    '17. 基于食药监食品安全量化分级数据及阿凡提点评食品安全评价投诉数据，形成“餐饮安全量化分级动态指标”，在阿凡提点评商户页面公示。',
                                    '18. 基于阿凡提点评餐饮商户评价与投诉数据，制成“阿凡提点评餐饮安全风险地图”，面向公众展示，同时供监管部门参考。',
                                    '19. 鼓励商户在阿凡提点评平台向用户展示店面和厨房环境，公示原材料和消毒清洁标准及相应供应商资质；对于有效展示真实信息的商户，阿凡提点评将给予商户更好的展示位置。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第三章 商户退出',
                        text: [
                            {
                                contentItem: [
                                    '20. 如商户提供给平台或对用户公示的信息存在虚假不实的情况，被查到后应立即改正，情况严重时将对商户做下线处理，永久不合作。（《查处办法》第42条）',
                                    '21. 如商户因餐饮安全问题被立案侦查、处以刑罚、被公安拘留、被吊销许可证或停业等，阿凡提点评将立即将商户下线。（《查处办法》第15条）',
                                    '22. 如通过媒体报道、阿凡提点评用户投诉及评价数据监控等方式发现商户重大餐饮安全侵害行为，阿凡提点评将立即将商户下线，并永不进行合作。（《食安法》62条）'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第四章 消费者保障',
                        text: [
                            {
                                subtitle: '（一）餐饮安全信息提供',
                                contentItem: [
                                    '23. 在阿凡提点评平台商户页面展示商户“餐饮安全量化分级动态指标”，亮出商户证照信息，确保消费者对商户餐饮安全情况了解知悉。',
                                ]
                            },
                            {
                                subtitle: '（二）餐饮安全举报与投诉处理',
                                contentItem: [
                                    '24. 消费者可通过阿凡提点评 APP 在线客服的餐饮安全专用入口及客服投诉热线，进行餐饮安全的投诉与举报。',
                                    '25. 客服部门成立专门的餐饮安全投诉应对小组，建立餐饮安全投诉等级制度，不同等级餐饮安全投诉由不同专业等级客服应对解决。',
                                    '26. 所有餐饮安全相关投诉，确保 24 小时内有解决方案。',
                                    '27. 用户在阿凡提点评消费，一旦出现餐品里有违规食品添加剂、异物、或出现用户因菜品质量就医等问题，用户提交信息后，阿凡提点评进行先行赔付。'
                                ]
                            },
                            {
                                subtitle: '（三）餐饮安全宣传',
                                contentItem: [
                                    '28. 在特定季节、节日等时期通过 APP 对消费者进行餐饮安全提示，如夏天提示少选择冷食，餐品送到及时食用等等。\n' +
                                    '第五章 配送安全',
                                    '29. 阿凡提外卖配送骑手和商家自配送人员应取得有效健康证明后，才能上岗，上岗时应确保工作衣、帽清洁。',
                                    '30. 阿凡提外卖配送和商户自配送骑手，不能进入商户后厨，不能直接接触餐品。配送过程中，要确保配送箱清洁无害、定期消毒，不能把餐品与有毒有害的物品一起存放和配送，同时保证餐品安全所需的温度、湿度等要求。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第五章 配送安全',
                        text: [
                            {
                                contentItem: [
                                    '29. 阿凡提外卖配送骑手和商家自配送人员应取得有效健康证明后，才能上岗，上岗时应确保工作衣、帽清洁。',
                                    '30. 阿凡提外卖配送和商户自配送骑手，不能进入商户后厨，不能直接接触餐品。配送过程中，要确保配送箱清洁无害、定期消毒，不能把餐品与有毒有害的物品一起存放和配送，同时保证餐品安全所需的温度、湿度等要求。\n' +
                                    '第六章 组织保障'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第六章 组织保障',
                        text: [
                            {
                                contentItem: [
                                    '31. 成立食品安全领导小组，设立首席食品安全官，筹划和组建食品安全管理工作组织体系，组建食品安全团队及各业务及其职能部门开展工作。',
                                    '32. 餐饮平台业务部门及相关职能部门，以本规则为指导制定本部门餐饮安全制度，并与员工绩效挂钩。',
                                    '33. 对餐饮安全事故进行分类分级，明确不同类别和等级餐饮安全事故的责任归属和处罚方式。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '第七章 社会共治',
                        text: [
                            {
                                contentItem: [
                                    '34. 阿凡提点评将挖掘餐饮安全方面的用户评价、投诉和举报数据，进行深度分析，形成智能数据报告，作为餐饮安全自查依据。在此过程中，发现违法行为及时制止，并将平台商户餐饮安全情况定期向政府监管部门报送。',
                                    '35. 阿凡提点评定期与平台上餐饮安全优质商户开展联合品牌宣传，对各地餐饮安全优质商户予以更多品牌曝光和更好的展示位置。',
                                    '36. 阿凡提点评设立并持续运营面向平台商户的微信公众号“放心食代”，及面向内部员工的公众号“生命线”，配合政府宣传部门，对商户和员工进行餐饮安全宣传教育，提升餐饮安全意识。',
                                    '37. 阿凡提点评将定期邀请食品安全研究机构、高等院校、咨询机构专家学者，面向员工和商户进行餐饮安全知识培训。',
                                    '38. 阿凡提点评积极与提供餐饮安全解决方案的专业机构合作，共同产出和应用如“安全餐盒”等一系列服务于从餐品制作到配送环节的解决方案，不断强化平台自身和平台商户的餐饮安全能力。\n' +
                                    '阿凡提点评集团'
                                ]
                            }
                        ]
                    }
                ]

            }
        },
        components: {WxcMinibar},
        methods: {
            backClick(){

            },
            minibarRightButtonClick(){

            }
        }
    }
</script>

<style scoped>
    .wrapper {
        background-color: white;
    }
    .content {
        padding-top: 24px;
        padding-bottom: 40px;
        padding-left: 26px;
        padding-right: 26px;
    }
    .headerText {
        margin-bottom: 8px;
    }
    .mt24 {
        margin-top: 24px;
    }
    .mb18 {
        margin-bottom: 18px;
    }
    .lineHeight {
        line-height: 34px;
    }
    .dcolor {
        color: #373737;
    }
    .bold {
        font-weight: bold;
    }
</style>
