<template>
    <div class="wrapper" >
        <div class="minibar">
            <wxc-minibar
                    background-color="#53beb7"
                    text-color="#fff"
                    @wxcMinibarLeftButtonClicked="backClick"
                    @wxcMinibarRightButtonClicked="minibarRightButtonClick"
                    v-once>
                <image :style="GLOBAL.headerImg" slot="left"
                       src="https://image.aftdc.com/appBimg/icon_back_normal.png"></image>
                <text :style="GLOBAL.headerCenter" slot="middle">协议及声明</text>
                <text :style="GLOBAL.headerRight" slot="right"></text>
            </wxc-minibar>
        </div>
        <scroller >
        <div class="content">
            <div class="header">
                <text class="headerText">阿凡提网用户协议</text>
            </div>
            <text class="coConfirmationText bold dcolor lineHeight38" :style="{fontSize:GLOBAL.bigFS}">阿凡提网与用户共同确认：</text>
            <text class="coConfirmationText bold dcolor lineHeight38" :style="{fontSize:GLOBAL.bigFS}" v-for="item in coConfirmationText">{{item}}</text>
            <div v-for="item in userProtocolText">
                <text class="mt30 dcolor bold" :style="{fontSize:GLOBAL.bigFS}">{{item.title}}</text>
                <div class="mt30" v-for="(list,i) in item.text" :class="[i==0?'mt24':'']">
                    <text class="dcolor lineHeight38" :style="{fontSize:GLOBAL.bigFS}">{{list.subtitle}}</text>
                    <text class="dcolor lineHeight38" :style="{fontSize:GLOBAL.bigFS}">{{list.content}}</text>
                    <text class="dcolor lineHeight38" :style="{fontSize:GLOBAL.bigFS}" v-for="value in list.contentItem">{{value}}</text>
                </div>
            </div>
        </div>
        </scroller>

    </div>
</template>
<script>
    import {WxcMinibar} from 'weex-ui'
    export default {
        data() {
            return {
                coConfirmationText: [
                    '1.    用户点击阿凡提网注册页面的同意注册按钮并完成注册程序、获得阿凡提网账号和密码时，视为用户与阿凡提网已达成《阿凡提网用户协议》，就用户进入阿凡提网消费（即用户通过阿凡提网与商家进行团购交易）达成本协议的全部约定。',
                    '2.    阿凡提网及用户均已认真阅读本《阿凡提网用户协议》(下称“本协议”)中全部条款（特别是以黑体字标示出的关于阿凡提网及用户重大权益的条款）及阿凡提网发布的其他全部服务条款和操作规则的内容，对本协议及前述服务条款和规则均以知晓、理解并接受，同意将其作为确定双方权利义务的依据。阿凡提网《法律声明》为本协议的必要组成部分，用户接受本协议的同时即视为接受阿凡提网《法律声明》的全部内容。'
                ],

                userProtocolText: [
                    {
                        title:'一、定义条款',
                        text: [
                            {
                                contentItem:[
                                    '1.1.“团购”：通过互联网渠道，一定数量的消费者组团，以较低价格购买同一种商品/服务的商业活动。',
                                    '1.2.“阿凡提网”：北京三快科技有限公司运营和管理的网络交易平台，域名为www.aftdc.com, 北京三快科技有限公司通过该网络交易平台为用户和商家提供进行团购交易的网络交易平台服务。本协议下文中，“阿凡提网”既指网络交易平台（www.aftdc.com），亦指北京三快科技有限公司。',
                                    '1.3.“用户”：接受并同意本协议全部条款及阿凡提网发布的其他全部服务条款和操作规则、通过阿凡提网进行团购交易的阿凡提网注册会员。',
                                    '1.4.“商家”：通过阿凡提网发布团购商品/服务信息、向用户提供团购商品/服务的自然人、法人和其他组织。',
                                    '1.5.“团购交易”：用户与商家通过阿凡提网进行的交易团购商品/服务的活动。',
                                    '1.6.“团购信息”：商家通过阿凡提网发布的，在阿凡提网页面上展示的团购商品/服务信息，包括但不限于团购商品/服务的名称、促销优惠（包括但不限于折扣券、抵用券、红包等）、种类、数量、质量、价格、有效期、预约时间、商家地址、配送方式、退换货方式、退款条件、售后服务等内容。团购信息在法律上构成商家就团购商品/服务向用户发出的要约。',
                                    '1.7.“团购价款”：用户为购买团购商品/服务而应向商家支付的团购商品/服务的对价，团购价款的数额以用户与商家达成的团购订单中约定的团购价格及团购数量为确定依据。',
                                    '1.8.“团购电子消费凭证”：由阿凡提网以页面、短信、电子邮件或其他方式向用户发送的电子形式的购货凭证或服务单据，内容为阿凡提券密码或二维码等（具体根据团购订单确定），用于证明用户已支付团购价款、有权获得所购买的团购商品/服务。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '二、用户注册',
                        text: [
                            {
                                subtitle:'2.1.注册资格',
                                content:'用户承诺：用户具有完全民事权利能力和行为能力或虽不具有完全民事权利能力和行为能力但经其法定代理人同意并由其法定代理人代理注册及应用阿凡提网服务。'
                            },
                            {
                                subtitle:'2.2.注册目的',
                                content:'用户承诺：用户进行用户注册并非出于违反法律法规或破坏阿凡提网网络团购交易秩序的目的。'
                            },
                            {
                                subtitle:'2.3.注册流程',
                                contentItem:[
                                    '2.3.1.用户同意根据阿凡提网用户注册页面的要求提供有效电子邮箱、所在城市等信息，设置阿凡提网账号及密码，用户应确保所提供全部信息的真实性、完整性和准确性。',
                                    '2.3.2.用户在注册时有权选择是否订阅阿凡提网发送的关于团购信息的电子邮件和/或短信息。',
                                    '2.3.3.用户合法、完整并有效提供注册所需信息的，有权获得阿凡提网账号和密码，阿凡提网账号和密码用于用户在阿凡提网进行会员登录。',
                                    '2.3.4.用户获得阿凡提网账号及密码时视为用户注册成功，用户同意接收阿凡提网发送的与阿凡提网网站管理、运营相关的电子邮件和/或短消息。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '三、用户服务',
                        text: [
                            {
                                content:'阿凡提网为用户通过阿凡提网进行网络团购交易活动提供网络交易平台服务，阿凡提网将根据市场需要，结合各业务部门的不同特点，可能向用户收取一定的服务费用。'
                            },
                            {
                                subtitle:'3.1.服务内容',
                                contentItem:[
                                    '3.1.1.用户有权在阿凡提网浏览团购商品/服务的团购信息、有权通过阿凡提网与商家达成团购订单、支付团购价款、获得团购电子消费凭证（如有）等。',
                                    '3.1.2.用户有权在阿凡提网查看其阿凡提网会员账号下的信息，有权应用阿凡提网提供的功能进行操作。',
                                    '3.1.3.用户有权按照阿凡提网发布的活动规则参与阿凡提网组织的网站活动。',
                                    '3.1.4.阿凡提网承诺为用户提供的其他服务。'
                                ]
                            },
                            {
                                subtitle:'3.2.服务规则',
                                contentItem:[
                                    '用户承诺遵守下列阿凡提网服务规则：',
                                    '3.2.1.用户应当遵守法律法规、规章、规范性文件及政策要求的规定，不得在阿凡提网或利用阿凡提网服务从事非法或其他损害阿凡提网或第三方权益的活动，如发送或接收任何违法、违规、违反公序良俗、侵犯他人权益的信息，发送或接收传销材料或存在其他危害的信息或言论，未经阿凡提网授权使用或伪造阿凡提网电子邮件题头信息等。',
                                    '3.2.2.用户应当遵守法律法规应当妥善使用和保管阿凡提网账号及密码，对其阿凡提网账号和密码下进行的行为和发生的事件负责。当用户发现阿凡提网账号被未经其授权的第三方使用或存在其他账号安全问题时应立即有效通知阿凡提网，要求阿凡提网暂停该阿凡提网账号的服务。阿凡提网有权在合理时间内对用户的该等请求采取行动，但对采取行动前用户已经遭受的损失不承担任何责任。用户在未经阿凡提网同意的情况下不得将阿凡提网账号以赠与、借用、租用、转让或其他方式处分给他人。',
                                    '3.2.3.用户通过阿凡提网与商家进行团购交易时，应当遵守本协议“团购交易规则”的全部约定及阿凡提网发布的其他关于团购交易的服务条款和操作规则的全部规定。',
                                    '3.2.4.用户在阿凡提网对团购商品/服务进行评价时应当根据实际情况如实进行评价。',
                                    '3.2.5.用户应当按照阿凡提网发布的规则参加阿凡提网抽奖等活动，遵守活动秩序。',
                                    '3.2.6.阿凡提网发布的其他服务条款和操作规则。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '四、团购交易信息',
                        text: [
                            {
                                content:'用户承诺在其进入阿凡提网消费，通过阿凡提网与商家进行团购交易的过程中良好遵守如下阿凡提网团购交易规则。'
                            },
                            {
                                subtitle:'4.1.浏览团购信息',
                                content:'用户在阿凡提网浏览团购商品/服务的团购信息时，应当仔细阅读团购信息中包含的全部内容，包括但不限于团购商品/服务的名称、种类、数量、质量、价格、有效期、预约时间、商家地址、营业时间、配送方式、退换货方式、退款条件、售后服务等内容，其中用户应特别注意团购商品/服务的有效期、预约时间及退款条件等内容，用户完全接受团购信息中包含的全部内容后方可点击购买。'
                            },
                            {
                                subtitle:'4.2.提交及确认团购订单',
                                contentItem:[
                                    '4.2.1.用户应当仔细阅读团购订单页面中所包含的全部内容，包括但不限于团购信息中的全部内容、为再次提示用户注意而标明的本单团购商品/服务的有效期、退款条件等内容（如有），选择及确认购买数量、价格、应付总额、用户接收团购电子消费凭证的联系方式或接收货物的收货地址和送货时间等内容。',
                                    '前述团购订单页面中所包含的全部内容，构成了用户与商家之间达成的团购合同的合同内容，用户完全同意团购订单的全部内容后方可提交订单。',
                                    '4.2.2.用户再次阅读并确认团购订单的全部内容后方可点击确认订单并付款，用户确认订单即视为用户已知晓、同意并接受团购订单中的全部内容，与商家成立了团购合同。团购订单中所包含的全部内容即为团购合同的内容，具体包括但不限于团购商品/服务的名称、种类、数量、质量、价格、有效期、预约时间、商家地址、营业时间、配送方式、退换货方式、退款条件、售后服务等，用户与商家均应当按照前述团购合同的约定履行各自的权利义务。',
                                    '4.3.支付团购价款',
                                    '在团购合同成立之后用户应根据付款页面的提示通过网上支付平台完成团购价款的支付。因阿凡提网接受商家委托代商家向用户收取团购价款，故用户将团购价款支付给阿凡提网且支付成功即视为用户已向商家履行了团购合同项下的团购价款支付义务。用户在支付团购价款之前无权要求商家向用户提供团购商品/服务。'
                                ]
                            },
                            {
                                subtitle:'4.4.团购电子消费凭证',
                                contentItem:[
                                    '4.4.1.用户支付团购价款成功后，阿凡提网向用户发送团购电子消费凭证，用户可按照团购合同的约定凭团购电子消费凭证向商家主张获得团购商品/服务。',
                                    '4.4.2.用户应当妥善保管团购电子消费凭证，因用户保管不善导致团购电子消费凭证被他人使用的，用户无权要求阿凡提网重新发送团购电子消费凭证。',
                                    '4.4.3.对于需要通过团购电子消费凭证验证进行消费的团购商品/服务，用户进行消费时，应向商家出示团购电子消费凭证，商家对团购电子消费凭证验证成功后按照团购合同内容的约定向用户提供团购商品/服务。',
                                    '4.4.4.团购电子消费凭证于发生以下情形之一时即失效：',
                                    '4.4.4.1.凭团购电子消费凭证已获得团购商品/服务；',
                                    '4.4.4.2.团购合同内容中约定的有效期届满。',
                                ]
                            },
                            {
                                subtitle:'4.5.退款规则',
                                contentItem:[
                                    '用户支付团购价款成功后，需要进行退款的，按照如下规则进行：',
                                    '4.5.1.发生以下情形之一的，用户有权要求阿凡提网代商家进行退款：',
                                    '4.5.1.1.因未达到最低团购人数，造成当次团购活动被取消的；',
                                    '4.5.1.2.用户付款成功后，因不可抗力或商家原因，导致商家无法向用户提供团购商品/服务，经阿凡提网核实后属实的；',
                                    '4.5.1.3.用户付款成功后，因确属情况变化导致商家需要变更团购合同内容，用户不接受变更后内容的。',
                                    '4.5.2.用户已实际消费团购商品/服务的，无权要求商家退款或要求阿凡提网代商家进行退款，但团购商品/服务与团购合同约定内容严重不符、存在其他严重质量问题或违反《网络交易管理办法》、《中华人民共和国食品安全法》、《中华人民共和国消费者权益保护法》的除外。',
                                    '4.5.3.团购合同约定的有效期届满但用户未在有效期内进行消费的，是否及如何退款应根据团购合同的约定确定。根据团购合同的约定用户有权要求退款的，用户应按照团购合同的约定要求阿凡提网代商家进行退款，在此种情况下如用户但未向阿凡提网要求退款的，即视为用户放弃了主张退款的权利，阿凡提网有权保留及处理此等款项。',
                                    '4.5.4. 用户成功进行团购交易后，未凭团购电子消费凭证进行实际消费且符合阿凡提网关于“未消费随时退款”约定的，用户可以向阿凡提网申请退款，经阿凡提网审核,用户的退款申请符合“未消费随时退款”约定的，阿凡提网将于2个工作日内退款至用户的阿凡提网账户内。',
                                    '如用户申请将款项退回至用户的支付账户的，即用户申请提现的，则阿凡提网将于1-7个工作日内将款项按照用户的支付路径原路退回至用户的支付账户；如用户在30日内申请提现的总金额大于或等于人民币5000元，则属于大额提现，阿凡提网针对大额提现将于60日内将款项按照用户的支付路径原路退回至用户的支付账户。',
                                    '4.5.4.1.已消费的阿凡提券；',
                                    '4.5.4.2.实物类产品（需物流运送的产品）；',
                                    '4.5.4.3.商城抵用券（包括实体商场及电子商城）；',
                                    '4.5.4.4.因非正常使用及保管而损坏的团购商品；',
                                    '4.5.4.5.在阿凡提网中明确标明“不支持未消费随时退款”的产品或服务；',
                                    '4.5.5.其他情形下的退款按照团购合同内容约定的退款条件及退款方式进行。',
                                    '4.5.6.在退款进行过程中，用户应当遵守阿凡提网关于退款的服务条款和操作规则的规定。'
                                ]
                            },
                            {
                                subtitle:'4.6.团购争议解决规则',
                                content: '如用户与商家因团购合同的履行发生任何争议，包括但不限于对团购商品/服务的数量、质量、价格、有效期、预约时间、商家地址、配送方式、退换货方式、退款条件、售后服务等问题发生争议的，用户应与商家根据团购合同内容的约定确定用户与商家各自的权利义务，承担各自的责任，解决争议。阿凡提网可协助用户与商家之间争议的协商调解。'
                            }
                        ]
                    },
                    {
                        title: '五、用户的权利和义务',
                        text: [
                            {
                                contentItem:[
                                    '5.1.用户有权按照本协议约定接受阿凡提网提供的阿凡提网网络交易平台服务。',
                                    '5.2.用户有权在注册时选择是否订阅阿凡提网发送的关于团购信息的电子邮件或短消息，并在注册成功后有权随时订阅或退订阿凡提网该等信息。',
                                    '5.3.如用户要求获得团购商品/服务的发票、其他付款凭证、购货凭证或服务单据，有权且应当在对团购商品/服务进行消费时向商家提出，发票金额以实际支付的团购价款为准。',
                                    '5.4.用户在消费团购商品/服务的过程中，如发现团购商品/服务与订单内容不符或存在质量、服务态度等其他问题的，应与商家采取协商或其他方式予以解决，阿凡提网可向用户提供商家的真实网站登记信息并积极协助用户与商家解决争议。',
                                    '5.5.用户有权随时终止使用阿凡提网服务。',
                                    '5.6.用户应保证其在注册时和提交订单时所提供的姓名、联系方式、联系地址等全部信息真实、完整、准确，并当上述信息发生变更时及时进行更新提供给阿凡提网的信息。',
                                    '5.7.用户在阿凡提网进行团购交易时不得恶意干扰团购的正常进行、破坏阿凡提网团购秩序。',
                                    '5.8.用户不得以任何技术手段或其他方式干扰阿凡提网的正常运行或干扰其他用户对阿凡提网服务的使用。',
                                    '5.9.用户不得以虚构事实等方式恶意诋毁阿凡提网或商家的商誉。',
                                    '5.10.用户通过阿凡提网进行团购交易应出于真实消费目的，不得以转售等商业目的进行团购交易。',
                                    '5.11.用户在付款成功后应配合接收货物或团购电子消费凭证。',
                                    '5.12.用户不得对团购商品/服务进行虚假评价或虚假投诉。',
                                    '5.13.用户应妥善保管阿凡提账号、密码、数字证书、手机动态口令、账户绑定的手机号码及阿凡提关联账户银行账户、卡号、密码、开户行预留的手机号码，及来自于阿凡提及/或开户行向您发送的校验码等与阿凡提账户或与阿凡提账户关联的银行账户有关的一切信息和设备。如您更换、暂停或终止使用上述信息和/或设备，或遗失或泄露前述信息和 / 或设备的，您应及时通知阿凡提网进行并及时联系阿凡提网进行解绑、变更或注销处理，以减少可能发生的损失。无论是否已通知阿凡提网，因上述原因所致损失需由您自行承担。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '六、阿凡提网的权利和义务',
                        text: [
                            {
                                contentItem:[
                                    '6.1.如用户不具备本协议约定的注册资格，则阿凡提网有权拒绝用户进行注册，对已注册的用户有权注销其阿凡提网会员账号，阿凡提网因此而遭受损失的有权向前述用户或其法定代理人主张赔偿。同时，阿凡提网保留其他任何情况下决定是否接受用户注册的权利。',
                                    '6.2.阿凡提网发现账户使用者并非账户初始注册人时，有权中止该账户的使用。',
                                    '6.3.阿凡提网通过技术检测、人工抽检等检测方式合理怀疑用户提供的信息错误、不实、失效或不完整时，有权通知用户更正、更新信息或中止、终止为其提供阿凡提网服务。',
                                    '6.4.阿凡提网有权在发现阿凡提网上显示的任何信息存在明显错误时，对信息予以更正。',
                                    '6.5.用户付款成功前，阿凡提网有权接受商家委托对订单内容作出变更，如用户接受变更后的内容则用户可确认订单及付款，如用户不接受变更后内容则有权取消订单。用户付款成功后，如确因情况变化导致商家需对订单内容作出变更的，阿凡提网有权接受商家委托单方对订单内容作出变更，如用户接受变更则按变更后的订单内容进行消费，如用户不接受变更则用户有权取消订单并要求阿凡提网代商家全额退款。',
                                    '6.6.阿凡提网保留修改、中止或终止阿凡提网服务的权利，阿凡提网行使前述权利将按照法律规定的程序及方式告知用户。',
                                    '6.7.阿凡提网应当采取必要的技术手段和管理措施保障阿凡提网的正常运行，并提供必要、可靠的交易环境和交易服务，维护团购交易秩序。',
                                    '6.8.如用户连续一年未使用阿凡提网会员账号和密码登录阿凡提网，则阿凡提网在通知用户后，有权注销用户的阿凡提网账号。账号注销后，阿凡提网有权将相应的会员名开放给其他用户注册使用。',
                                    '6.9.当一次团购活动中团购人数未达到最低团购人数要求时，阿凡提网有权取消本次团购活动，并根据本协议约定向已支付相应团购价款的用户进行退款。',
                                    '6.10.阿凡提网有权在本协议履行期间及本协议终止后保留用户的注册信息及用户应用阿凡提网服务期间的全部交易信息，但不得非法使用该等信息。',
                                    '6.11.阿凡提网有权随时删除阿凡提网网站内各类不符合国家法律法规、规范性文件或阿凡提网网站规定的用户评价等内容信息，阿凡提网行使该等权利不需提前通知用户。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '七、用户信息',
                        text: [
                            {
                                content:'阿凡提网非常重视用户个人信息的保护，在您使用阿凡提网提供的服务时，您同意阿凡提网按照在平台上公布的《隐私政策》收集、存储、使用、披露、处理和保护您的个人信息。阿凡提网希望通过《隐私政策》向您清楚地介绍对您个人信息的处理方式，因此建议您完整地阅读《隐私政策》，以帮助您更好地保护您的隐私权。'
                            }
                        ]
                    },
                    {
                        title: '八、特别声明',
                        text: [
                            {
                                contentItem: [
                                    '8.1.用户未通过阿凡提网与商家之间进行的交易不属于阿凡提网团购交易，阿凡提网对不属于阿凡提网团购交易的交易事项不承担任何责任，用户不得因其与商家之间因此类交易发生的任何争议投诉阿凡提网或要求阿凡提承担任何责任。不属于阿凡提网团购交易的情况具体包括：用户未在阿凡提网与商家成立订单；用户虽在阿凡提网与商家成立订单，但未通过阿凡提网而直接向商家支付款项。',
                                    '8.2.不论在何种情况下，阿凡提网对由于信息网络设备维护、信息网络连接故障、电脑、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务不承担责任。',
                                    '8.3.作弊、扰乱交易秩序的情况',
                                    '8.3.1除活动规则另有规定外，每次活动中，每个用户只限参加一次活动（活动包括并不限于促销优惠、秒杀、抽奖等等），每个用户只能中奖一次。同一手机、同一联系方式、同一IP地址、同一阿凡提网账户、同一身份证件、同一银行卡号、同一收货地址、同一终端设备号或其他可以合理显示为同一用户的情形，均视为同一用户。',
                                    '8.3.2活动期间，如发现有用户通过不正当手段（包括但不限于侵犯第三人合法权益、作弊、扰乱系统、实施网络攻击、恶意套现、刷信誉、批量注册、用机器注册阿凡提网账户、用机器模拟客户端）参加活动而有碍其他用户公平参加本次活动或有违反活动目的之行为，活动举办方有权取消其获奖资格或其因参加活动所获赠品或权益。如该作弊行为给活动举办方造成损失的，活动举办方保留追究赔偿的权利。',
                                    '8.3.3对于恶意进行注册，反复交易退款，侵害阿凡提实际经营交易的情况，阿凡提会停止服务、封停账号并追究责任。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '九、知识产权',
                        text: [
                            {
                                contentItem:[
                                    '9.1.阿凡提网所包含的全部智力成果包括但不限于数据库、网站设计、文字和图表、软件、照片、录像、音乐、声音及其前述组合，软件编译、相关源代码和软件 (包括小应用程序和脚本) 的知识产权权利均归阿凡提网所有。用户不得为商业目的复制、更改、拷贝、发送或使用前述任何材料或内容。',
                                    '9.2.阿凡提网名称中包含的所有权利 (包括商誉和商标) 均归阿凡提网所有。',
                                    '9.3.用户接受本协议即视为用户主动将其在阿凡提网发表的任何形式的信息的著作权，包括但不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给阿凡提网所有，阿凡提网有权利就任何主体侵权单独提起诉讼并获得全部赔偿。本协议属于《中华人民共和国著作权法》第二十五条规定的书面协议，其效力及于用户在阿凡提网发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。',
                                    '9.4.用户在使用阿凡提网服务过程中不得非法使用或处分阿凡提网或他人的知识产权权利。用户不得将已发表于阿凡提网的信息以任何形式发布或授权其它网站（及媒体）使用。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '十、客户服务',
                        text: [
                            {
                                content:'阿凡提网建立专业的客服团队，并建立完善的客户服务制度，从技术、人员和制度上保障用户提问及投诉渠道的畅通，为用户提供及时的疑难解答与投诉反馈。'
                            }
                        ]
                    },
                    {
                        title: '十一、协议的变更和终止',
                        text: [
                            {
                                subtitle:'11.1.协议的变更',
                                content:'阿凡提网有权对本协议内容或阿凡提网发布的其他服务条款及操作规则的内容进行变更，阿凡提网将按照法律规定的程序及方式发布公告。如用户继续使用阿凡提网提供的服务即视为用户同意该等内容变更，如用户不同意变更后的内容则用户有权注销阿凡提网账户、停止使用阿凡提网服务。'
                            },
                            {
                                subtitle:'11.2.协议的终止',
                                contentItem:[
                                    '11.2.1.阿凡提网有权依据本协议约定注销用户的阿凡提网账号，本协议于账号注销之日终止。',
                                    '11.2.2.阿凡提网有权终止全部阿凡提网服务，本协议于阿凡提网全部服务依法定程序及方式终止之日终止。',
                                    '11.2.3.本协议终止后，用户无权要求阿凡提网继续向其提供任何服务或履行任何其他义务，包括但不限于要求阿凡提网为用户保留或向用户披露其原阿凡提网账号中的任何信息，向用户或第三方转发任何其未曾阅读或发送过的信息等。',
                                    '11.2.4.本协议的终止不影响守约方向违约方追究违约责任。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '十二、违约责任',
                        text: [
                            {
                                contentItem:[
                                    '12.1.阿凡提网或用户违反本协议的约定即构成违约，违约方应当向守约方承担违约责任。',
                                    '12.2.如用户违反本协议约定，以转售等商业目的进行团购交易，则阿凡提网有权代商家取消相关团购交易，并有权注销其阿凡提网账号，终止为其提供阿凡提网服务，如阿凡提网因此而遭受损失的，有权要求用户赔偿损失。',
                                    '12.3.如因用户提供的信息不真实、不完整或不准确给阿凡提网或商家造成损失的，阿凡提网有权要求用户对阿凡提网或对商家进行损失的赔偿。',
                                    '12.4.如因用户违反法律法规规定或本协议约定，在阿凡提网或利用阿凡提网服务从事非法活动的，阿凡提网有权立即终止继续对其提供阿凡提网服务，注销其账号，并要求其赔偿由此给阿凡提网造成的损失。',
                                    '12.5.如用户以技术手段干扰阿凡提网的运行或干扰其他用户对阿凡提网使用的，阿凡提网有权立即注销其阿凡提网账号，并有权要求其赔偿由此给阿凡提网造成的损失。',
                                    '12.6.如用户以虚构事实等方式恶意诋毁阿凡提网或商家的商誉，阿凡提网有权要求用户向阿凡提网或商家公开道歉，赔偿其给阿凡提网或商家造成的损失，并有权终止对其提供阿凡提网服务。'
                                ]
                            }
                        ]
                    },
                    {
                        title: '十三、争议解决',
                        text: [
                            {
                                content: '用户与阿凡提网因本协议的履行发生争议的应通过友好协商解决，协商解决不成的，任一方有权将争议提交北京仲裁委员会依据该会仲裁规则进行仲裁。'
                            }
                        ]
                    },
                    {
                        title: '十四、协议生效',
                        text: [
                            {
                                content:'本协议于用户点击阿凡提网注册页面的同意注册并完成注册程序、获得阿凡提网账号和密码时生效，对阿凡提网和用户均具有约束力。'
                            }
                        ]
                    }
                ]
            }
        },
        components: {WxcMinibar},
        methods: {
            backClick(){

            },
            minibarRightButtonClick(){

            }
        }
    }
</script>

<style scoped>
    .wrapper {
        background-color: white;
    }
    .content {
        padding-top: 68px;
        padding-bottom: 68px;
        padding-left: 42px;
        padding-right: 42px;
    }
    .header {
        border-bottom-width: 2px;
        border-bottom-style: solid;
        border-bottom-color: #c0c0c0;
    }
    .headerText {
        font-size: 42px;
        color: #373737;
        font-weight: bold;
    }
    .coConfirmationText {
        margin-top: 30px;
    }
    .mt30 {
        margin-top: 30px;
    }
    .lineHeight38 {
        line-height: 38px;
    }
    .dcolor {
        color: #373737;
    }
    .bold {
        font-weight: bold;
    }








</style>
