// pages/league/league.js
Page({

  data: {
    explain:[
      {
        name:'入驻阿凡提需要什么条件？',
        txt:"入驻阿凡提需要有实体店铺，需要准备门脸照片、店内照片、门店logo、身份证照片、营业执照、餐饮许可证。"
      },
      {
        name: '入驻阿凡提流程是怎么样？',
        txt: "1.需要您填写店铺的名称、地址、门店照等基本信息   2.上传您的身份证、行业资质和餐饮许可证即可完成入驻"
      },
      {
        name: '与阿凡提合作的收费标准是什么？',
        txt: "不同的配送模式、不同的市场的收费标准是不同的，提交入驻申请后会有市场经理与您详细沟通"
      },
      {
        name: '我想找市场经理帮我线上开店，怎么联系？',
        txt: "提交信息后，12小时内将会有市场经理与您联系。"
      },
      {
        name: '开店申请提交后多久店铺能上线？',
        txt: "提交信息后进行审核，审核结果将在3个工作日内以短信的方式通知您。"
      }
    ]
  },

  onLoad: function (options) {
    
  },

 
})